In [1]:
import numpy as np 
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101) # 'seed'to get same random number as prof

In [7]:
df =pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

# Indexing and Selection DataFrames

In [11]:
df['W'] # it is actually series
#DataFrames are just Bunch of Series , that shares the same  index

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [12]:
df.W# the column can be also slected like this#not very recommended

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
df[['W','Z']]#passing the list

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [27]:
df['new']=df['W']+df['Y']#create a new columns

In [28]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [29]:
df.drop('new',axis=1) #dropping or delete the column
#but df['new'] is not entirely deleted

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [31]:
#To completey delete the columnn df['new']
df.drop('new',axis=1, inplace=True) #dropping or delete the column

In [32]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [33]:
df.drop('E',axis=0)#deleting the row

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [35]:
df.shape #axis is taken from numpy axis = (rows,columns)

(5, 4)

In [36]:
df.loc['A'] #for ROW

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [38]:
df.iloc[2]#index based location

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

subset of rows and columns

In [39]:
df.loc['B','Y'] #value at row B and column Y

0.16690463609281317

In [40]:
df.loc[['A','B'],['W','Y']] #passing the list of rows and columns

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905